[
    { 
        "title": "GizzyUwU Murdered by Parliament Assembly Member Manni",
        "type": "Breaking", 
        "author": "Ghost of Lynn", 
        "date": "June 25, 2025", 
        "content": "<h3>Yesterday, The Republic of Hack Club witnessed yet another brutal murder, this time by a member of the 2nd Parliament Assembly.<br><br>Watch it happen <em><a href = `https://hackclub.slack.com/archives/C08FA68NV2T/p1750779725486169`>here</a></em><br><br>Just days prior, GizzyUwU had celebrated the murder of Lynn by Astra, and now, is the 2nd victim of homicide in the Republic.<br><br>This homicide will be notable given it occured after the passing of the Meurtre est Interdit Act, making it illegal to commit homicide. If found guilty, Manni could serve the death penalty. It is unclear when the HCNAO plans to press charges, however it may be after legislation around the death penalty is drafted and passed.</h3>"
    },
    {
        "title": "Government of Hack Club Unveils Hackpines City: Biggest Digital Infrastructure Project In The History of Our Nation",
        "type": "Normal",
        "author": "Astra C.",
        "date": "June 20, 2025",
        "content": "<h3><b>HACKPINES CITY</b> — Last night, officials from the Democratic Republic of Hack Club unveiled its most ambitious project yet - a digital city under the name 'Hackpines'. The project itself is still under development but there seems to be much investment into the project prior to the announcement already.<br><br><i>''Hackpines is the first city ever in the Democratic Republic of Hack Club, but it still has a long way to go until fully deployed! That's why we need your help! Join us at <a href='https://hackclub.slack.com/archives/C08UC8C4AGZ'>#hackpines</a> to develop this city further by coding, writing history, geography, anything! This will be the biggest digital infrastructure project yet in the history of our nation, and once it's up and running, you'll be able to walk around, interact, and explore the city online!'' (Astra.Celestine)</i><br><br>From public information, the new city will offer an international airport supposedly named the Latta International Airport after the founder of Hack Club - Zach R. Latta. The city itself is a low-lying coastal city close to a few smaller islands to the east and forests and mountains inland. Hackpines is planned to be divided into 4 administrative regions and 15 districts.<br><br><table><tr><th>Administrative region</th><th>District</th></tr><tr><td rowspan='5'>Central Metropolitan Area</td><td>Latta District</td></tr><tr><td>Hacklyn District</td></tr><tr><td>Astral District</td></tr><tr><td>Kay District</td></tr><tr><td>Orphean Heights</td></tr><td rowspan='4'>Outer Metropolitan Area</td><td>Hackridge District</td></tr><tr><td>Orpheion District*</td></tr><tr><td>Rainbow District</td></tr><tr><td>Cyrillic District</td></tr><td rowspan='3'>The Pines</td><td>Meow District</td></tr><tr><td>Hackmarsh District</td></tr><tr><td>Celestial District</td></tr><td rowspan='3'>Coastal Area</td><td>La Mer District</td></tr><tr><td>Hackbay District</td></tr><tr><td>Trashbeard District</td></tr></table><br><br>There also appears to be plans by members of Parliament to turn the future Hackpines city into the capital city of the Democratic Republic of Hack Club, relocating main government buildings and offices to the Central Metropolitan Area. Regardless, this is a large step forward for the future of the D.R. Hack Club.</h3>"
    },
    { 
        "title": "Lynn/L87 murdered in the Parliament Chambers: Ryan and Supporters Celebrate",
        "type": "Breaking", 
        "author": "Ghost of Lynn", 
        "date": "June 20, 2025", 
        "content": "<em>*This article is a continuation of a previous report</em><h3>Earlier yesterday, Lynn (L87) was murdered in the Parliamentary Chambers during a discussion on the Meurtre est Interdit Act, which would make murder illegal.<br><br><em>This act makes the act of homicide in any capacity illegal. Homicide is defined as the killing of one person by another. Homicide is carried out as such in the Slack: `*kills user` (Meutre est Interdit Act Proposition, June 2025).</em> <br><br>Lynn's killer was Astra.Celestine, another member of the Peanut Gallery, which they both hold representation in. Prior to murdering Lynn, Astra stated: <em>`3: i wanna krill`</em>. This was in direct response to Lynn's question on why Astra voted against making murder illegal. It is assumed <em>krill</em> meant <em>kill</em>. As of this article, Astra remains the sole vote against the proposition.<br><br>This event was celebrated by Ryan, and one of his supporters. When Astra made mention of this event in the Parliament General Channel, both Ryan and GizzyUwU reacted with the <em>yay</em> emoji. When the Ghost of Lynn questioned GizzyUwU, he stated to her <em>''Your too Anti Ryan To be liked''.</em> Ryan has not yet voted on the Meutre est Interdit Act.</h3>"
    },
    {
        "title": "Nuclear Bombs Found In Hackpines City",
        "type": "Opinion",
        "author": "Manni",
        "date": "June 20, 2025",
        "content": "<h3>BREAKING NEWS!!!<br><br> Nuclear Bomb Facility Discovered in Hackpines<br><br> Authorities have uncovered a secret nuclear bomb facility hidden in the town of Hackpines. A newspaper investigation team has been dispatched to the location for on-site reporting.<br><br> The suspected creator of the facility is linked to a company known as Brek Factory. Sources indicate the facility is owned by an individual operating under the alias '<em>Magical Paperclip</em>'.<br><br> Stay tuned for live updates as the situation develops.</h3>"
    },
    { 
        "title": "Lynn/L87 murdered in the Parliament Chambers",
        "type": "Breaking", 
        "author": "Ghost of Lynn", 
        "date": "June 19, 2025", 
        "content": "<h3>Earlier today, Lynn (L87) was murdered in the Parliamentary Chambers during a discussion on the Meurtre est Interdit Act, which would make murder illegal.<br><br><em>This act makes the act of homicide in any capacity illegal. Homicide is defined as the killing of one person by another. Homicide is carried out as such in the Slack: `*kills user` (Meutre est Interdit Act Proposition, June 2025).</em> <br><br>Lynn's killer was Astra.Celestine, another member of the Peanut Gallery, which they both hold representation in. Prior to murdering Lynn, Astra stated: <em>`3: i wanna krill`</em>. This was in direct response to Lynn's question on why Astra voted against making murder illegal. It is assumed <em>krill</em> meant <em>kill</em>. As of this article, Astra is the sole vote against the proposition.</h3>"
    },
    {
        "title": "End of hUWUp representation in Parliament",
        "type": "Breaking",
        "author": "Lynn",
        "date": "June 8, 2025",
        "content": "<h3>Parliament has just ended a vote to impeach Lynn/L87, the hUWUp representative in Parliament for conflicting positions on both the Oversight and Legislative branches.<br><br><em>Lynn (hereby referred to as L87) is in two government branches: that of the Legislative branch, and the Oversight branch.</em><br><br>Lynn has decided to forfeit her legislative posititon, and distribute her seats to Loop (Independent), marking the end of hUWUp representation in Parliament.<br><br>The final bill proposed by hUWUp was the historic Republic Amendment, which passed referendum hours before the vote. A new election is now taking place to decide if Lynn will be admitted to the Peanut Gallery, the very gallery she created and further defined through law.</h3>"
    },
    {
        "title": "End of hUWUp representation in Parliament",
        "type": "Breaking",
        "author": "Lynn",
        "date": "June 8, 2025",
        "content": "<h3>Parliament has just ended a vote to impeach Lynn/L87, the hUWUp representative in Parliament for conflicting positions on both the Oversight and Legislative branches.<br><br><em>Lynn (hereby referred to as L87) is in two government branches: that of the Legislative branch, and the Oversight branch.</em><br><br>Lynn has decided to forfeit her legislative posititon, and distribute her seats to Loop (Independent), marking the end of hUWUp representation in Parliament.<br><br>The final bill proposed by hUWUp was the historic Republic Amendment, which passed referendum hours before the vote. A new election is now taking place to decide if Lynn will be admitted to the Peanut Gallery, the very gallery she created and further defined through law.</h3>"
    },
    {
        "title": "Republic Amendment Referendum in a Toss-Up",
        "type": "Breaking",
        "author": "Lynn",
        "date": "June 6, 2025",
        "content": "<h3>The tension over the name of the nation continues following Parliament's resounding approval of the Republic Amendment. <strong>What hasn't been so resounding, is the public's support in the referendum.<strong><br><br>As of this article's publication, soon to be halfway into voting, the vote stands at 6 in favor to 4 against. Thisis  a stark contrast to the 80%+ of seats in Parliament voting in support.<br><br>It is unclear where this situation will lead.</h3>"
    },
    {
      "title": "Parliament Celebrates 2025 Pride Month",
      "type": "Normal",
      "author": "Astra C.",
      "date": "June 5th 2025",
      "content": "Today, on the 5th of June, the Parliament of the Hack Club nation celebrated Pride Month by releasing an official Pride logo for Parliament as well as a pride banner on <a href=\"https://hcgov.github.io/parliament\">its official website</a>. Additionally, the HCNAO (Hack Club National Attorney Office) also added a Pride themed banner on <a href=\"https://hcgov.github.io/attorney/\">its site</a> as well 2 days earlier.<br><br>This represents a momentous occasion showing that the nation of Hack Club's acceptance and support for its large LGBTQIA+ population despite the harsh times."
    },
    {
        "title": "Republic Amendment projected to pass Parliament",
        "type": "Breaking",
        "author": "Lynn",
        "date": "June 5, 2025",
        "content": "<h3>Parliament has been in dissent this week over passing legislation on defining the official name of the nation. This may be ending with the Republic Amendment, which currently has support from PM and 70+ seats in favor.<br><br><em>This amendment defines and establishes both the United Republic of Hack Club and the Democratic Republic of Hack Club as valid legal names referring to our nation.</em><br><br>The amendment must still pass public referendum if passed by Parliament.<h3>"
    },
    {
        "title": "Parliament in dissent over legal name of the Nation",
        "type": "Breaking",
        "author": "Lynn",
        "date": "June 4, 2025",
        "content": "<h3>Parliament has been in dissent this week over passing legislation on defining the official name of the nation. Proposed names from Astra.Celestine and Hackbridge Parties include <em>The Democratic Republic of Hack Club</em> and <em>The United Republic of Hack Club</em><br><br>Resistance against this movement has been spearheaded by Ryan, over the 'boring nature' of the proposed names.<br><br>This comes as a total of 4 legislations have been proposed on the matter, all of which have either been rejected or are set to reject. The 2nd Parliament Assembly has seen the most rejected proposals in the history of the Nation, and this conflict illustrates the division in our Government.<h3>"
    },
    {
        "title": "Government Indicted over Standard of Time Act",
        "type": "Breaking",
        "author": "Lynn",
        "date": "June 3, 2025",
        "content": "<h3>The Hack Club Parliament has been accused of passing legislation which violates Article I of the constitution.<br><br><em> Forcing everyone to use UTC time disregards citizens' freedom to observe time in ways that suit their daily life, culture, or locality, infringing on personal liberties guaranteed by Article I.</em><br><br>This is the first case against the Government with the HCNAO involved, and is a historic landmark in the history of the Nation.<h3>"
    }
]
