[
    {
        "title": "End of hUWUp representation in Parliament",
        "type": "Breaking",
        "author": "Lynn",
        "date": "June 8, 2025",
        "content": "<h3>Parliament has just ended a vote to impeach Lynn/L87, the hUWUp representative in Parliament for conflicting positions on both the Oversight and Legislative branches.<br><br><em>Lynn (hereby referred to as L87) is in two government branches: that of the Legislative branch, and the Oversight branch.</em><br><br>Lynn has decided to forfeit her legislative posititon, and distribute her seats to Loop (Independent), marking the end of hUWUp representation in Parliament.<br><br>The final bill proposed by hUWUp was the historic Republic Amendment, which passed referendum hours before the vote. A new election is now taking place to decide if Lynn will be admitted to the Peanut Gallery, the very gallery she created and further defined through law.</h3>"
    },
    {
        "title": "Republic Amendment Referendum in a Toss-Up",
        "type": "Breaking",
        "author": "Lynn",
        "date": "June 6, 2025",
        "content": "<h3>The tension over the name of the nation continues following Parliament's resounding approval of the Republic Amendment. <strong>What hasn't been so resounding, is the public's support in the referendum.<strong><br><br>As of this article's publication, soon to be halfway into voting, the vote stands at 6 in favor to 4 against. Thisis  a stark contrast to the 80%+ of seats in Parliament voting in support.<br><br>It is unclear where this situation will lead.</h3>"
    },
    {
      "title": "Parliament Celebrates 2025 Pride Month",
      "type": "Normal",
      "author": "Astra C.",
      "date": "June 5th 2025",
      "content": "Today, on the 5th of June, the Parliament of the Hack Club nation celebrated Pride Month by releasing an official Pride logo for Parliament as well as a pride banner on <a href=\"https://hcgov.github.io/parliament\">its official website</a>. Additionally, the HCNAO (Hack Club National Attorney Office) also added a Pride themed banner on <a href=\"https://hcgov.github.io/attorney/\">its site</a> as well 2 days earlier.<br><br>This represents a momentous occasion showing that the nation of Hack Club's acceptance and support for its large LGBTQIA+ population despite the harsh times."
    },
    {
        "title": "Republic Amendment projected to pass Parliament",
        "type": "Breaking",
        "author": "Lynn",
        "date": "June 5, 2025",
        "content": "<h3>Parliament has been in dissent this week over passing legislation on defining the official name of the nation. This may be ending with the Republic Amendment, which currently has support from PM and 70+ seats in favor.<br><br><em>This amendment defines and establishes both the United Republic of Hack Club and the Democratic Republic of Hack Club as valid legal names referring to our nation.</em><br><br>The amendment must still pass public referendum if passed by Parliament.<h3>"
    },
    {
        "title": "Parliament in dissent over legal name of the Nation",
        "type": "Breaking",
        "author": "Lynn",
        "date": "June 4, 2025",
        "content": "<h3>Parliament has been in dissent this week over passing legislation on defining the official name of the nation. Proposed names from Astra.Celestine and Hackbridge Parties include <em>The Democratic Republic of Hack Club</em> and <em>The United Republic of Hack Club</em><br><br>Resistance against this movement has been spearheaded by Ryan, over the 'boring nature' of the proposed names.<br><br>This comes as a total of 4 legislations have been proposed on the matter, all of which have either been rejected or are set to reject. The 2nd Parliament Assembly has seen the most rejected proposals in the history of the Nation, and this conflict illustrates the division in our Government.<h3>"
    },
    {
        "title": "Government Indicted over Standard of Time Act",
        "type": "Breaking",
        "author": "Lynn",
        "date": "June 3, 2025",
        "content": "<h3>The Hack Club Parliament has been accused of passing legislation which violates Article I of the constitution.<br><br><em> Forcing everyone to use UTC time disregards citizens' freedom to observe time in ways that suit their daily life, culture, or locality, infringing on personal liberties guaranteed by Article I.</em><br><br>This is the first case against the Government with the HCNAO involved, and is a historic landmark in the history of the Nation.<h3>"
    }
]
